{"2018-09-02": {"neg": ["Eminem says the Secret Service questioned him after his anti-Trump freestyle: https://slate.trib.al/41CjnfN pic.twitter.com/NcFwMDAjUS", "How dare you put the family in the situation you did with the Trump’s when you knew his wishes. You are disgusting Graham!", "The thing is, when these Trump idiots tweet their normal stupid shit and they get called on it, they don’t delete the tweets because willful ignorance is a badge of honor in Trump’s America. ", "Trump really so bad he made black people like George Bush and Hillary Clinton", "And you will continue to hate him no matter what", "Trump is 50% American and 50% certified moron.", "NYT article attempts to \"whitewash\" Ohr's involvement in dirty tricks campaign against #Trump https://twitter.com/nytimes/status/1036004543753068545 …", "They've got something wrong with them when they are so obsessed by Trump and he's not even around.", "Anyway anyone any time bash Trump again and again that's all the fake media knows about.", "That's fake news a-hole."], "pos": ["Plus, you’re Austin, which is bedlam for great bands....", "Lol. The only decent thing is it over #DecencyMyAss", "SO TRUE .... Useful,Idiots never learn the lessons of socialism  #climatechange #globalwarming @TheDemocrats @potus @IvankaTrump @realDonaldTrump @jaredkushner @VP @SpeakerRyan @Secy_State_US @SenTedCruz @SenateMajLdr @WhiteHouse @Tomas_Regalado", "Good read:\nTKACHUK: Trudeau, not Trump, deserves our NAFTA ire https://torontosun.com/opinion/columnists/tkachuk-trudeau-not-trump-deserves-our-nafta-ire/ … #cdnpoli #NAFTA", "@realDonaldTrump Wait there is more! https://www.dailykos.com/stories/2018/9/2/1792803/-POTUS-s-pattern-of-potentially-obstructive-conduct-is-even-greater-than-first-known …", "I’m sure that’s right up trump’s alley ", "America already IS great.  And when you leave office (hopefully sooner than later) she will return to her true VALUES", "LMAO but you'll still be 55 and fat.", "I can agree with Shalala because ICE handles human trafficking and we don’t want to abolish that aspect so fix the agency and clean it up.  I would fire most of them good ole boy Trump lovers and get some kind caring empathetic sorts.", "So cute!!! Lol\nI had that hair "]}, "2018-09-17": {"neg": ["Trump's aides have tried to tell him things look bad for November, but he's not hearing it https://www.dailykos.com/story/2018/9/17/1796373/-Trump-s-aides-have-tried-to-tell-him-things-look-bad-for-November-but-he-s-not-hearing-it …", "Translation: GOP pinning election hopes on ignorance of Trump base.\n https://twitter.com/Tom_Winter/status/1041802206029041664 …", "'Corrupt intent' could be problem for Trump in a Manafort pardon https://www.msnbc.com/rachel-maddow/watch/-corrupt-intent-could-be-problem-for-trump-in-a-manafort-pardon-1321029187514 … via @msnbc", "Too bad they all still make poverty wages", "Explains why I’m so exhausted.", "They (along with the majority of patriotic Americans) now realize Trump is trying to \"subvert\" the Mueller investigation, BUT it's too late!", "@POTUS @realDonaldTrump I don't know why but this organization sounds plain evil.", "Paul McCartney \"I Hate You, Yeah, Yeah, Yeah\" https://grrrgraphics.com/paul-mccartney-i-hate-you-yeah-yeah-yeah/ … @realDonaldTrump @POTUS", "Deadspin Josh Gordon Traded To The Patriots, Of Fucking Course | Splinter Donald Trump Jr. https://ift.tt/2phvVza  ༄\n\nDeadspin Josh Gordon Traded To The Patriots, Of Fucking Course | Splinter Donald Trump Jr. Is Losing It Over Brett Kavanaugh | The Slot The Threat to Any Man | … pic.twitter.com/ijCoz6TzGy", "Ol #Trump must've been confused and thought he was describing #HurricaneHarbor \n•\n#HurricaneFlorence #Hurricane #WaterPark #DontMatter!!! #WakeUp #RiseUp #ExpectUs #NoJusticeNoPeace… https://www.instagram.com/p/Bn2LbBShelN/?utm_source=ig_twitter_share&igshid=gvqzyhz7rkd5 …"], "pos": ["Tick Tock Swalwell...........\nMore of this to come.pic.twitter.com/SWk9mihXXX", "Love it. Let's get the truth out there and see what exactly was going on before, during and after Trump was inaugurated.", "@realDonaldTrump GREAT DAY FOR WINNING!\nMR PRESIDENT\n THANK YOU \n\"We the people\" love you", "KAG! ROFL WTFU!\n\n\" TRUMP WINS ECONOMY TANKS IMMEDIATELY\"\n\n\" TRUMP WON'T RUN \"\n\n\" DT CAN'T BEAT 17 R's Is \"\n\n\" DT CAN'T BEAT BILLary \"\n\n\" ONLY JEB! CAN BEAT BILLary\" \n\n\" BERNIE BS SANDERS CAN BEAT DT \"\n\n\" KASICH/RUBIO HIGHER POLLS VS HC \n\n\" DT WON'T BUILD WALL$3.6B+ALREADY STARTED", "So happy Trump declassified these documents. We need to know the treachery these people perpetrated upon Trump American people.", "Not so much under Bush but the Clinton and Obama years were reasonable. If you’re just gonna be sarcastic then we might as well not bother having this conversation. Good luck to you.", "Maybe your good friend Michael Cohen can help you sue Mark, right after the two of you finish impeaching Trump. Any day now, right Tom?", "McCain was a registered Republican and the libtards and #FakeNews gave him a send off fit for a Pharaoh precisely because he was a traitor to his Republican President, Republican Party, Republican Constituents and The Republic of the USA, up to his neck in the Trump-Russia fraud.", "I'm sure Trump never stages a photo...", "#DrainTheSwamp - @JudicialWatch’s Chris Farrell: Strzok & Page knew McCabe would conspire with them to target @realDonaldTrump and those around him. This is the greatest outrage & abuse of authority at the FBI that this country has ever seen. #MAGA #TrumpTrain #Dobbspic.twitter.com/Tx2DxvcjpD"]}, "2018-09-23": {"neg": ["To me, CNN is just drama 100 % of the time.  CNN does Breaking News for something that (IMO) is not that important....but that CNN probably thinks will make Trump look bad.", "If you are attempting to have me think about this t/way you do, that’s never going to happen. She is now part of history, at t/precise moment when she was victim shamed & called a liar by the U.S. @GOP congress, @realDonaldTrump, & their voters - humiliated to no end. Disgusting.", "The bikers should be there Thursday to kick some anti Trump protester ass if they get violent, would like to see thousands of bikers and Trump supporters there, it's time to stand up to these assholes https://twitter.com/Carolin17951107/status/1043978846419079168 …", "Its a game ,they can't let trump get another one", "Poor guy stuck listening to a blithering idiot talk about himself all night", "Is it horrible that can’t stop watching this?", "You hate Trump. Pence would be your worst nightmare. Lol #feministsstink", "What a pile of idiotic nonsense! Republicans put forth a shady and extremely unfit candidate and now that is being exposed the need someone to blame. Guess what gop... no one believes you!", "\"It seems the Trudeau government has begun to unfortunately learn from the worst aspects of the Trump government, that is a willingness to inflate numbers and to demonize their questioners while side-stepping serious inquiry.\nOver the last... http://bit.ly/TheLiesStillPourForth …", "FUCK THAT,AT THE END OF THE DAY TRUMP’S STILL PRESIDENT"], "pos": ["You make a very good point!", "@realDonaldTrump caused the problem now WE, the taxpayers,  have to bail out farmers? Brilliant.", "Happy to meet you!", "Why does @Jack_Septic_Eye get as many tweets as @realDonaldTrump?", "President Trump: “We need Josh in the Senate to fight for Missouri…and our whole country.” ~ Follow President Trump’s pick for Missouri for more updates  https://twitter.com/HawleyMO  ~ pic.twitter.com/JKTk5EYHXY #Missouri #DonaldTrump #JoshHawley #KeepAmericaGreat", "More Gasoline On The Trump v. Justice Department Fire http://dlvr.it/Ql2Mq9 pic.twitter.com/n5qilI1N1u", "Because he knows he’s more valuable to trump being brown.", "This is Trump's model for losing Congress and winning re-election - CNN Politics https://apple.news/AJjVMX9FwRQSuAp-zkE1q3Q …", "Best ..ONE & ONLY GREAT POTUShttps://archive.org/details/jfks19610427 …", "Enjoy your evening P Trump! Congrat AbeShinzo glad you have a chance to be back in your home!"]}, "2018-09-21": {"neg": ["Via @WRAL: Rosenstein Suggested He Secretly Record Trump and Discussed 25th Amendment  http://fw.to/G1hdYIj ", "They wanted Trump to immediately fire RR based on the NYT story.\n\nTrump isn’t stupid...", "You voted wrong. Sorry Bruh.", "Donald Fucking Trump is a gemini like me  https://twitter.com/MrMouthAlmighty/status/1043248749882077186 …", "#TXSenateDebate  Holy crap.  He is lying Ted.  Hate to agree with Trump.", "Oh we are fucked", "This is such an inhumane comment.", "I’m sorry u had these things happen to u", "that's just ridiculous.", "Yes 40000 homeless vets and you want to go back to the way things were? WTF is wrong with you? Why do you hate vets?"], "pos": ["Thousands of women and men crush Trump like a wrecking ball with own stories of unreported sex abuse https://www.dailykos.com/story/2018/9/21/1797539/-Hashtag-WhyIDidn-tReport-begins-to-explode-on-Twitter-by-women-and-men …", "Enjoy the Trump rally.", "Please we don't need you again... -from a friendly Canadian", "Sure i just saw trump signing Q to someone with his hand ", "You are officially a sycophant. Nice legacy Lindsey. Your friend must be so proud.", "It's amazing how much Lindsey turned around regarding Trump...\nIs Trump holding the AG job for Lindsey in return for the pledge of loyalty.", "WELL well now, Seems the Qdawg and Sister Brielle Thomas are geared up for the KEEPING AMERICA GREAT TRUMP TRAIN! All the while a visit from the local TRUMP TIME Candidate Oran Way making his presence known in northern Noble County!;) — feeling... https://www.facebook.com/680460416/posts/10160652641425417/ …", "Let’s ask all the women who have accused the Pussy Grabber of sexual assault to present their evidence in a public setting.  The Donald can present all of his delusional conspiracy theories about how the sexes interact!  Then the Country can make its own judgement!", "You so full of lies even Apple are being affected smh", "#WhyIDidntReport because the rapist told me \"I own the police, they won't listen to you\""]}, "2018-09-26": {"neg": ["Trump makes the US look bad, not the media!", "I wish Trudeau would tell Trump to go fuck Kavanaugh.", "I know, we have the same problem here with BrExiT & Theresa May. Another laughing stock but maybe not quite as embarrassing as Trump \nPeople here now complaining about Brexit being bad for the country as if there weren’t people saying it every day!", "IDIOT", "Trump Gets Tough with Election Hackers http://tinyurl.com/y9yez2p6  #JustPlainPolitics", "@realDonaldTrump rejects Canada leader Justin Trudeau's request to meet, unhappy with NAFTA - KAG approved! https://www.rawstory.com/2018/09/trump-rejects-canada-leader-justin-trudeaus-request-meet-unhappy-nafta-talks/#.W6wdApa-7_k.twitter …", "Looks like something North Korea would do - WTF?", "'Resistance' Hero Brian Krassenstein Admits to Being Paid for Hijacking Trump's Twitter Feed in Secret Recording https://www.thegatewaypundit.com/2018/09/resistance-hero-brian-krassenstein-admits-to-being-paid-for-hijacking-trumps-twitter-feed-in-secret-recording/ … via @gatewaypundit", "Definition of MORON:\nTrump: World leaders were laughing with me @CNNPoliticshttps://www.cnn.com/videos/politics/2018/09/26/trump-un-speech-laughing-with-me-sot-tsr-vpx.cnn/video/playlists/trump-united-nations-news-conference/ …", "Damn Kayleigh, I knew you were stupid, but I didn’t know you were crazy as well."], "pos": ["He's the full document, since your picking to edit, also called the pentagon about Russians and accused Trump of murder https://www.judiciary.senate.gov/imo/media/doc/09.25.18%20BMK%20Interview%20Transcript%20(Redacted).pdf …", "I love you @MichaelAvenatti", "Good video editing, Donnie. Almost makes you seem important.", "That is why world leaders were laughing at his moronic remarks, right?\n\nHe is a GREAT example of how not to use tanning spray.", "There is not one damn thing that Trump says that's believable.", "Democrats Have A Shot At Winning The Senate — And Blocking Trump’s Court Picks https://www.huffingtonpost.com/entry/democrats-path-to-a-senate-majority-runs-through-unfriendly-territory_us_5ba3ce1fe4b0375f8f9b1119?ncid=engmodushpmg00000004 … via @HuffPostPol", "Six more years! Six more years !", "So perhaps THE BEST THING about Vermont is that you post some \"cry for help\" stuff on FB about watching Donald J. Trump's completely unhinged/potentially strung out/high on something press conference AND EVERYONE... https://www.facebook.com/nicole.bartner/posts/876369912561207 …", "Great article. This country better get out & #VoteBlue #VoteThemAllOut @GOP needs to go the way of the Whig party...DEFUNCT. @KamalaHarris @maddow @JillWineBanks @SteveSchmidtSES @StephenAtHome @TeaPainUSA @robreiner @evansrc717", "Trigger Warning: \n\nIf Trump tried to pull #TheEmperorHasNoClothesChallenge in the WH what percentage of the staff would compliment him on how good he looks in his new suit?"]}, "2018-09-29": {"neg": ["Boy are you weird!", "@realDonaldTrump quoted \"Stone Cold\" @steveaustinBSR \"the rattlesnake\"pic.twitter.com/IvgneafdFD", "USA - - 'This Is a Farce, Not an Investigation': Trump Accused of Rigging FBI's Kavanaugh Probe By Imposing 'Outrageous' Limits - Common Dreams - https://www.commondreams.org/news/2018/09/29/farce-not-investigation-trump-accused-rigging-fbis-kavanaugh-probe-imposing …", "Why is Trump randomly tweeting about @SenBlumenthal", "Supreme Criminal Of The United States", "Trade talks stuck in neutral as Trump 'very unhappy' with Canadian negotiator\n\nhttps://www.theguardian.com/us-news/2018/sep/29/nafta-latest-us-canada-trade-talks-deadline?CMP=Share_AndroidApp_Tweet …", "This is disgraceful disgusting behavior and trump is  the cause https://twitter.com/NBCNews/status/1046137342216601601 …", "Omg boofs for evil... I can't even... ", "COMING FROM A FAKE POTUS AND FAILED BUSINESSMAN!https://www.businessinsider.com/trump-attacks-blumenthals-military-service-heres-the-real-story-2017-8 …", "I'm with you, Lisa. I was an extremely reticent Trump voter back in '16 but today, after all the dirty shit I've seen every single day the past two years and now this, I wish the vote was tomorrow. They are going to be shocked at the polls."], "pos": ["You have a lot of nerve discussing anyone’s service when you evaded service with “rich boy” syndrome.", "Excellent! All the while the Democrats are trying to assassinate Judge Kavanaugh’s character, President Trump and the Republicans are quietly making America great again", "Just watching Presi Trump Rally & My God Presi exactly enacted Feinstein's sharade of, Oh I didn't leak the letter, my office didn't leak it I don't know who did. It was so funny. My God our Presi is great, he says how it is, he speaks the truth& that's why these Libs dislike him", "I find it oddly entertaining you go after trump so much when Hillary bent you over the table. Well guess it is what it is happy Halloween.", "“I make up my own mind to whatever Trump tells me to think” ", "HAHAHAHA! That's great!!!!", "Interesting! I'll tell you what, Jerry....I will LITERALLY give my vote in 2020 to Trump if he survives and wins a genuine street fight in his home turf of Queens, NYC. \n\nNo proxies, no Secret Service stepping in, just two street fighters in a honest asphalt brawl.\n\nDeal?", "These guy have done so much good for the atheist movement", "However, after Judge Brett Kavanaugh testified, even President Donald Trump was impressed. Demanding a Senate vote for his confirmation, Trump tweeted that Kavanaugh was the man for the job.", "Amazing, huh?"]}, "2018-09-24": {"neg": ["Wrong you’re stated facts are totally false : Ahh I see another Russian Bot reported poof! ", "I wanna go see Trump so bad but I’ll have practice ", "Rod Rosenstein Suggested Secretly Recording Trump and Removing Him: http://youtu.be/HvbIioC5sWo?a  via @YouTube", "the truth about trump is he is a moron with a 5th or 6th grade education. not unlike yourself when you graduate UofA.", "Hey Real_Fascist, let's get FBI  investigate you. You are innocent, there is nothing to be afraid of. Man, you seriously need a history lesson. Perhaps, then you'd understand why Stalinism is bad. Perhaps you won't, based on crap you post.", "So you hate immigrants also? Wow you are banging on all the hate buttons. How are you still active on Twitter?", "The potential for disposable is Trumps hallmark. He serves evil & satanic. He plies deceit & an encompassing romantic synchronous vibration to explain terror & horror to his baseless fiendish inept. Decrypt salutes him. Pathetic warms him. Confusion adores his tyrannical wrath.", "Just imagin it could be worse, it could be the Trumps ", "I think, when all is said and done, @SenMajLdr McConnell will fare worse in history than @POTUS Trump https://twitter.com/OMGno2trump/status/1044304417183477760 …", "Idiot"], "pos": ["Contact the job out to a nice Canadian company ", "I’m in the construction business and it has never been as good as it is right now. There are soo many jobs but no one to work them around here. Everyone around here has brand new vehicles nice homes. I’m sorry your salary might be stagnant but things are good in my area", "Ooh, more material for SNL.", "This tweet made me feel better until I read @buddystone tweet right below my tweet. He's right in saying Trump isn't normal and doesn't care. This is pure unadulterated insanity.", "He is treated fairly", "My President is so cool  and we live in a country that is so free because of our great Armed Forces - and Trump has made so many Graphic Artists famous. Because he is so famous fir doing great things everyone is riding his coattails! #MAGA", "Problem is conservatives have a weak-kneed spineless group of reps who are easily bullied by Dems & media! When are they going to understand that Trump got elected because he fights back & they should do same to win!", "Great scope. Latest Q drop says that Rachel Brandt temporary replacement would not be acting AG.  Q names an obscure rule that allows Trump to pick his own replacement for 2oo+ days.  Check it out if you can.  That would be awesome.", "Okay. Go sit down and read some facts. Your ignorance is outstanding!", "HITLER IS NOT DONALD TRUMP WHO HAS PROVEN HE WANTS TO MAKE AMERICA THE America we all love"]}, "2018-09-10": {"neg": ["Trump may be an imbecile, but compared to Hillary he’s goddamn einstein", "Then, you voted for the wrong guy.", "It will fail like all their other strategies.", "As bad as the one that hit Puerto Rico?  And if so, will you head down south to throw rolls of paper towel?", "Arresting children...see Putin is like Trump.....that's some really sick shit.. .and violates International Laws too... https://twitter.com/McFaul/status/1039216949706649605 …", "You are funny.......what's pathetic is that you support a treasonous Trump.", "John McCains foundation would grab children who crossed the border illegally- and sell them to the Saudis and others...McCain was a monster", "On the tape, Trump sounds like the idiot that he is. https://www.msn.com/en-us/news/politics/omarosa-shares-tape-of-trump-discussing-deadly-niger-ambush/ar-BBN9nom?ocid=spartanntp …", "If Obama did such a horrible job why is Trump taking credit for it?", "Fake news"], "pos": ["Yes all 750 people of an 8k seat arena was awesome. Trump fills the arenas plus standing room and lines out the door!", "Is there any way you could start tweeting like an adult and not a preteen, that'd be great.", "Well I’m fairly certain nothing will convince the OP. However the hope is that some will take the time to read the information and it will be curious to learn more. Hope springs eternal lol", "@BarackObama Interesting!", "We're bringing in more revenue under Trumps tax cuts.", "Love Trumps Magic wand !!!!", "Watch Live: Dem Operative Omarosa Says Russia Helped Trump Win Election https://www.infowars.com/watch-live-dem-operative-omarosa-says-russia-helped-trump-win-election/ …", "His voice compliments the WOW WOW trumpet PERFECTLY...like the Peanuts adult speak.  GREAT MUSIC", "Gotta love Obama’s excuses", "I don't click shortened links, feel free to share the full link."]}, "2018-09-13": {"neg": ["People are saying Fuck ICE bc they are the face of the movement but everyone knows that the one behind it is Trump. In the Hispanic community, we say Fuck Trump but we know ICE is the one enforcing it. Just how people say Fuck 12 when all they are doing is enforcing it aswell", "This is an outrageous lie! And absolutely sickening that a) you are saying this, b) you are saying it while we are dealing with another hurricane, c) that we have taken ZERO learnings from Maria because you are an idiot and d) that you want to cause 3000 families more pain", "You don't need anyone's help to look bad. Looking bad is the only thing you are actually good at.", "Trump is an idiot. Wake up usa", "You are not GOOD", "Our driver ranting about Trump \n\n“Trump must be on that good crack. I want to know what he’s taking because he’s fucking crazy. He has something mentally wrong with him. He is the worst president we’ve ever had.”", "Sounds like you’re describing Trump, silly fascist.", "So, I guess the hurricane is trumps fault because he pulled out of the Paris accord. Too bad the fathers of all these democrats and media personalities didn’t pull out", "Jake Tapper: Trump’s conspiracy theory is ‘shocking and disturbing’ #Topbuzz http://va.topbuzz.com/s/eeYmRx  ", "The democrats have nothing to do to make you look bad you do it yourself... from Canada with hate!"], "pos": ["Welcome to the club ", "The start of the Great President Barack Obamapic.twitter.com/puhHSvolT6", "See no evil, hear no evil, speak no evil.", "I fixed it for you JT:\nA US election system that many call arcane allowed the xenophobic and fear-based message of Donald Trump to triumph over Hillary Clinton's demonstrably more popular message of social liberalism and ethnic,gender and racial equality and tolerance.", "What do they have on, meaning Trump? LOL!!", "No, we don't. He is awesome. I dislike the MSM so much that #trump battle with the media makes me excited in so many ways. We have a President that is so honest with us the people that we know what he is thinking at all times. We love President Trump. #maga #politics #Trump2020", "wait trump just gave them 10 mil from the hurricane response fund and they want more,", "MAGAts aren't too bright.", "Funny, sure smatters of that “Socialism” you and yours so sorely despise.", "@MSNBC trump has narcissistic personality disorder with paranoid ideation  Full "]}, "2018-09-27": {"neg": ["ABC = Fake News.", "#KavanaughHearings you know what makes it so bad where is the Democrats are they even watching this guy or what.. we know Grassley and Trump and all them they ain't trying to see all this weak baby s***", "Your daughter must be so disgusted by you.", "He was so guilty he was almost crying...a weak supreme court judge ...sad", "He was an embarrassment he was a descent man then drank whatever glass trump has drunk from and turned nasty and angry. What happens to him?", "By promoting one thing you’re not discounting another, but false claims are false claims, lack of evidence and rebuked claims from her named witnesses are what they are.", "Because he’s hysterical, partisan, misogynist, shill just like you?", "He was definitely playing to trump and his base...and what the hell happened to @LindseyGrahamSC what a revolting nasty angry little man he is...", "Idiot", "Duh!"], "pos": ["He showed he’s arrogant, aggressive and hateful towards women,  and will lie blatantly to get what he personally wants, and probably should be in jail.  So, yeah, just like your kind of guy then!", "Oh my gosh this is is the exact thing I was thinking watching his testimony today!", "Lol then you absolutely don't know what the \"f\" you're talking about.", "ABSOLUTELY VOTE NO to Sexual Assaulting Judge & VOTE OUT ALL the @GOP @LindseyGrahamSC @SpeakerRyan @tedcruz & EVERYONE who represents Egotistical SELF @realDonaldTrump & @IvankaTrump @HouseGOP @senjudiciary @BrettKavanaugh FYI @PrincessBravato @EdKrassen @TheDemCoalition", "Just when you think there isn’t anything in the world more despicable than @realDonaldTrump you find a tweet from his spawn @DonaldJTrumpJr.https://twitter.com/davidhogg111/status/1045180431098773505 …", "You don’t sound like you believe her if you’re still supporting Kavanuagh...", "Mr President you pick the best of the best.  !!!    All the way with Brett first thing tomorrow morning !!!!!", "Love those rally’s!!", "I cannot imagine how that man could ever be viewed as an impartial member of the SCOTUS after the animus he displayed against democrats today and his embrace of the latest Trump conspiracy theory about attempts to block his appointment.", "“It Was All Going Surprisingly O.K. Until the Press Conference”: At the U.N., Diplomats Grapple with a Diminished Trump - Vanity Fair https://apple.news/A0rAEsG0dSTiCLykopBs0KQ …"]}, "2018-09-20": {"neg": ["But I’m a crazy bot ", "Instead of cutting Medicaid,  I vote that they cut the paycheck of any government official who backs Trump by 75%.", "Apparently I've been living under a rock lately and also did not know. I'll just say I'm so sorry I googled this and now know.pic.twitter.com/TFOxsAydP4", "JOIN THE DEPLORABLE MUG CLUB!\n\nEach order generates a donation to Wounded Warrior (Verified)\n\nclick the link now:https://teespring.com/the-definition-of-deplorables#pid=522&cid=101894&sid=front …", "MORE MANDATORY CRAP VIEWING? FAKE NEWS.pic.twitter.com/Lzfap5CPPr", "Poor Vegas", "Did he tell you that because Trump’s investigation was proven to be “fake news” compliments of Donald Trump", "Sad", "house investigation =/= muller probe", "If it is Pro Trump then it is against @Jack's rules and he will suppress your Civil Rights. If it is Anti Trump, and violent you get presents https://twitter.com/Sniper64286433/status/1042924376817950721 …"], "pos": ["More than 6-in-10 Midterm Voters Support Trump’s Tariffs on Imports\nhttps://www.breitbart.com/big-government/2018/09/20/more-than-6-in-10-midterm-voters-support-trumps-tariffs-on-imports/ …", "Best one so far!  Love it", "I liked a @YouTube video http://youtu.be/jDo0fnMMH0Y?a   WATCH LIVE: President Donald Trump Holds MAGA Rally in LAS VEGAS, NV 9/20/18", "Then stop obstructing justice and wait for Mueller to find you innocent...", "This feels appropriate so many women! Enjoy @realDonaldTrump\nhttps://youtu.be/ipanM9TwPeU ", "Clinton was accused of sexual attacks after he was re-elected...not before. Trump should never have been elected...he bragged about walking in on YOUNG pageant contestants dressing rooms without warning on top of charges of feeling up women in bars and other deviant acts!", "Better every day! Love our POTUS! #MAGA ", "LOL..YOUR COMPANY PAY FOR THE WALL...YOU ARE SOOO RICH YOU SAID..OHH AND ON THE RALLYS YOU SAY TO YOUR PROPLE THAT YOU ARE ALREADY BUILDING UR F.. WALL WHAT A LIAR.SAD", "Top story: @realDonaldTrump on Twitter pic.twitter.com/cwsjUjW3Nr, see more http://tweetedtimes.com/krobca2011?s=tnp …", "Hope you get laryngitis, enjoy."]}, "2018-09-14": {"neg": ["#failed", "They stand behind Trump don’t they?", "All this Team Trump praise of Manafort is now extremely awkward https://thinkprogress.org/paul-manafort-donald-trump-plea-deal-mueller-investigation-russia-election-interference-102b89fa2dee/ …", "Also the fact that even to whatever extent they \"curb Trump's worst impulses\", they have zero formal authority to do so.", "\"Through your actions, you [#trump] have embarrassed us in the eyes of our children, humiliated us on the world stage and, worst of all, divided us as a nation,\" McRaven added in the op-ed. \n\nhttps://twitter.com/2021_free/status/1040738434611073024 …", "Pardon is off the table because he would then be forced to testify and couldn’t plead the fifth.", "Why are Trump supporters so violent that they would burn shoes and clothes that could be donated to the needy?", "Sheer panic brought on by a bad case of #PaulManafort would be my guess ", "Obama blamed Bush all the time during his pathetic presidency....", "Terrible leadership"], "pos": ["Tweet: Blue is a beautiful color\nTrump Bot Twitter: OH MY GOD HOW CONTROVERSIAL A LIBERAL WOULD THINK THAT.", "Please stop arguing about this! So disrespectful to those who were lost and their loved ones!", "My light bulb just burnt out and my parents died ", "Lmao this is hilarious..especially since you think he is going to be able to run", "You are my new best friend ", "Or maybe you just can't ever take responsibility for your own actions, Twitler!\n\n#trumpuniversity\n#hatesbrownpeople\n#WorstPresidentEver", "@MSNBC @CNN\n\nI grew up in America, and I know American history, so to see McCain made out to be a hero, I know one thing for sure and that's history isn't accurate at all.", "Trump, a day before 2016 election: \"If I don’t win, this will be the greatest waste of time, money and energy in my lifetime, by a factor of 100.\" \n\nNo. Winning, that's what it was.\n\nThe best we can hope for is that... https://www.facebook.com/jeremysherm/posts/10160755362535459 …", "sure *wink*.", "Eric is so good at raising money! But watch closely because he likes to pocket money meant for kids cancer treatment - so he may be tempted when taking from gullible Trumpkins."]}, "2018-09-04": {"neg": ["This is sick.", "He'll lie and tell Trump Woodward is fake.", "Is that because they are somewhat spineless and feel they can't say \"Yes, I said it\" to your face? Hmmmm... Any time would be bad timing for you?", "He hasn’t me weird", "Doesn’t anyone care that he is a liar & criminal?", "Very shocking news.", "What Trump Thinks Was His \"Biggest F’ING Mistake\" Will Make You Sick https://reverbpress.news/news/trump-condemning-violent-nazis-was-biggest-f-ing-mistake-ive-made/ … via @reverbpress", "Trump White House Shocking Revelations https://www.coolconversations.co/trump-white-house-shocking-revelations/ …pic.twitter.com/jhY5IhyNoL", "Trump: Nike’s campaign sends a ‘terrible message’ https://dizzed.com/trump-nikes-campaign-sends-a-terrible-message/ …", "What u mean is you'll believe what you want captain ponzy scheme."], "pos": ["Trump's Singapore Strategy may have been brilliant. \nCan Trump and Kim do more? Like launch global nuclear disarmament talks?\nhttps://rinj.press/news-rinj-press/september-2018/trump-and-kim-prevented-war-can-they-do-global-nuclear-disarmament/ …", "Watching this rube defend a reality show star and Outer Borough NY grifter is very satisfying.", "Hey #Patriots check out our fellow rapper Patriot @NiteMare817 ‘s new song! It’s great! Warning Adult Language. https://www.reverbnation.com/nitemare817/song/29974847-guess-whos-backedited … @realDonaldTrump #TuesdayThoughtspic.twitter.com/MhTWpb9ULg", "W The Latest: Trump calls quotes in Woodward book 'frauds' (from @AP)https://apnews.com/2d14ce9650684632827d17fb61799625 …", "You are beating them at every turn and you are doing for me and at your peril. Thank you so much for turning our country around. Keep up the great work", "So you're okay with Putin having trump over a barrel. You're okay with trump and his family, his cabinet of \"best people\" treating the treasury like their own piggy bank. You're ok with a bunch of amoral crooks. Good to know.", "Said right after hitting the crack pipe!", "@realDonaldTrump I saw your tweet and heard your words........ but the Great Orange God of the Trailer Park Dwellers told us that the things we see and hear aren't real.", "I am sure they are all telling he truth.pic.twitter.com/oIiXoA8l6h", "Trump's trade actions are heating up quickly https://www.cbsnews.com/news/trumps-trade-actions-are-heating-up-quickly/ … #SmartNews"]}, "2018-09-05": {"neg": ["National security purposes?  Crazy House indeed!", "Trump Rants and Lies About the New York Times After Devastating Op-Ed Deals a Blow to His Presidency @alternethttps://www.alternet.org/news-amp-politics/trump-rants-and-lies-about-new-york-times-after-devastating-op-ed-deals-blow-his#.W5Bt_vWqGVo.twitter …", "In your book \"The Making of Donald Trump\" you said his grandfather Friedrich lied on his application for citizenship, can an argument be made that Donald is an illegal?", "Believe the obvious. Who rants every day about how unfair it is? The guilty man thats afraid to testify.  He is weak.", "and when asked about it, donald held up his sock puppet and mouthed..\"fake news\"", "You're an idiot.", "Must be afraid trump will yell at him if he did.", "No one is considering it could be Trump writing this to distract from Mueller and create a reason, to claim there is a coup , and a reason for Marshall law.This is the type of thing Pres would do, to give reason to look victimized to his base to divide further.Just listen to Fox", "Pathetic little putz", "Trump suggests protesting should be illegal  http://www.nola.com/national_politics/2018/09/trump_suggests_protesting_shou.html …pic.twitter.com/AjyPE9VkBg"], "pos": ["I think it's good. The GOP was sneakily creating problems for this country since Reagan...least Trump is making it clear what the party now stands for...and it ain't pretty...", "More like he/she turned you over!!!  Lol ★★★★☆", "A perfect place for all the anti-trump women activists 2 go  &\nSample life Under Sharia law.", "More Trump winning", "If you do your job well what’s the hurry if your boss chooses to wait a month or two to pay you.\nYou don’t look good grasping at straws. Good day!", "Stanley Cup winning Washington Capitals snub Trump | David Menzies https://youtu.be/IQuwIJnax8w  via @YouTube", "We have plent #ConfirmKavanaugh  is a good man.", "Nah, Trump doesn't know to write more than a sentence.", "Someone in the kitchen maybe, a brave patriot who refuses to give Trump an extra scoop of ice cream.... https://twitter.com/CillizzaCNN/status/1037490239370092544 …", "Loving my new Nike shoes, you should try ‘em Ted!"]}, "2018-09-01": {"neg": ["I understand she lost her father and I feel for her, but what she did today was distasteful and classless along with Obama and Bush. There is lot of damaging info about their admins coming out, the attacks against Trump will get worse. they are pond scum !", "The corruption is in your administration, which Mueller is putting together, piece by criminal piece.", "He hasnt done anything.He is only effective at causing chaos &discord...he is the epitomy of evil. HE's a hater...His dealings NEVER pan out,thats a fact.Hes a shyster & youve fallen for his scam.I cant support him because he stands for is everything that is wrong in the world.", "There you go referencing fake journalism.", "They pay us in service, by fighting side by side with our military, by using diplomacy to spread peace and protect Americans and American interests at home and abroad, and by supporting us through imports and exports. You’re a moron and a traitor.", "To bad he couldn't keep it going. Worst recovery in history.", "You base your actions on a fake news website you crotchety old man.", "Even with your fake news and social media censorship, you are unable to prove that Trump has not increased jobs, and grown the economy.  the problem with feminism is it has tricked women into thinking in politics you can just get mad at facts and change them with ignorance.", "You refuse to see the corruption and blindly worship an evil being. Sad.", "NAFTA was so bad that you’re keeping the name. #terriblepresident #FakeNews #firetrump"], "pos": ["I love the hand in the pocket..", "Trump is best thing to happen to America for more than one reason he's fixing our country but had he not won we never would have known the level of corruptness that was going on within our government\nThank God for Trump", "HONESTLY (YOU DONT KNOW THE WORD) NO ONE WANTS TO DEAL WITH A SWINDLER LIKE YOU.....", "America is great. That was clearly evident at Senator McCain’s service today.", "It’s like magic happens when my resistance heroes meet", "Meghan McCain contrasts father's legacy with Trump's 'cheap rhetoric' http://flip.it/iuWj5f ", "No it's not it true why lie the guy was a traitor ask the POW's an vets they cant a stand that traitor no what you have is a President who isnt trying to fool us. An so funny how the libs are claiming McCain as their own good you can have his sorry ass", "It is and has always been Great... we don’t need you to suggest what has always been.", "MB has squandered billions on HSR to Nowhere. Good riddance to him.", "Great to know Caryn. Cheers "]}, "2018-09-15": {"neg": ["You either hate facts and truth or your a homosexual. I say that because you block Trump supporters and have a lot to say about homophobia.", "\" The strongest voices against Trump are from x-Republicans like @TheRickWilson\" He's infantile,  hypocritical and anything but an  x-republican.", "Sorry buddy, but if you think the 4 presidents before Trump we’re doing anything other than selling out our country, you’re the one living in a fantasy.", "I thought that polls were fake?", "Your schtick has become so so boring #yawn", "Danny Tarkanian is on the hook for 14.5 million dollars in a bad business deal. He made the deal without even investigating and pricing out what he was buying into. This is not a person you want the US Senate, someone who is  so careless with money.", "Donald Trump is an evil genius: How he abandoned political strategy and won over the GOP's bloodthirsty base - S...\nhttp://bki.me/2wPudO4e ", "Did anyone else read Keith “ Doofas? I must be getting tired of tweeting to Dumbass! Having him at the WH is exhausting! ", "Let’s help John here, finish this quote “Trump is as insecure as....”", "#NewWorldNextWeek: Trump Cabal Threatens #Syria With A Chemical False Flag (Video) https://mediamonarchy.com/2018/09/nwnw351-video/ …pic.twitter.com/54zsJHOzlY"], "pos": ["LOL shall we have THAT autographed pic of you again Mz Speaker", "Best ever??? More lies?", "FUNNIEST TRUMP CAN'T WIN COMPILATION https://www.youtube.com/attribution_link?a=pmTUaZpf14Q&u=%2Fwatch%3Fv%3DG87UXIH8Lzo%26feature%3Dshare …", "This makes me so very happy!!!!!! Congatulations, @GenFlynn!!!!!", "Except for the 60% that oppose him and a growing number of \"the best people.\"\nPaul Manafort—Guilty & Cooperating\nRick Gates—Guilty & Cooperating \nMike Flynn—Guilty & Cooperating\nPapadopoulos—Guilty & Cooperating\nMichael Cohen—Guilty & Cooperating", "This is great! I want them for all of the jailed tRump crew (and hopefully the rest of the crooked administration).", "Hey @realDonaldTrump , how many rolls do you have lined up for the people affected by #florence ?https://twitter.com/Stop_Trump20/status/1041003741435109376 …", "So let’s remove the walls from your house... you think it would be ok?", "Why do your tweets always sound like they’re coming from a parody account?", "This exactly what Trump adores, people that grovel and genuflect to him. Brock is a Trump grovel minion and genuflector for sure."]}, "2018-09-08": {"neg": ["Bingo! See,Gumede the only difference between you and I is that I don't indulge in misery. I am a very crazy person. Crazy people make things happen.", "I get it but this crisis is very dangerous. We are looking at the flashpoint for WW III if we allow the British controlled coup to trap Trump into going to war over a proven false flag! pic.twitter.com/dzNtvuHkYq", "I get it but this crisis is very dangerous. We are looking at the flashpoint for WW III if we allow the British controlled coup to trap Trump into going to war over a proven false flag! pic.twitter.com/BgiaDC81k4", "@realDonaldTrump Obama is out there campaigning and making efforts to cause more social unrest like he did for eight long ugly years with his preaching style race baiting. I know that with the exception of the low-IQ goers to his rallies the rest of America is really sick of him.", "Stupid is as stupid does\n\nUS trade wars: The farmers who trust Trump, but not without worries - http://www.bbc.co.uk/news/world-us-canada-45451692 …", "I don't dress my pug up like this halloween/cute lil costumes....bc I know he hates it but I wish this lil guy could bounce up to Pres Trump n say \"Oh I'm a bad mo-fo!\" https://twitter.com/pugspic/status/1038574769606729730 …", "GOP believes Obama's anti-Trump message will rally Republican base during midterm elections - USA TODAY https://apple.news/AM_fqgIdRTJaMVdLmlzReIg …", "2 truths & lie:\n-i smell like cojita cheese\n-i am addicted to skin picking\n-i am donald j. trump", "President Trump, Republicans using impeachment threat as tool to motivate their base https://cnn.it/2NZQdb9 ", "Poor Paulina Crazytown.  "], "pos": ["IMO it's Nick Ayers without Pence's knowledge but with Pence's Presidential aspirations top of mind! \n\nPence denies 25th Amendment talks to oust Trump following NYT op-ed's claim https://politi.co/2wYfRGF ", "Thank you for supporting our professional athletes' RIGHT to kneel during the national anthem. I have an excellent idea for #NFLKickoff ! A procession of Ford F-150's lead into the stadium, stuffed to the brim with FREE NIKE products to toss out to those watching the game!", "Need Trump but he will win!", "For centuries, talented people around the world move to the states, and today you are trying to let them to be the workers rather than engineers? Is that the right thing to do?", "So you r the most popular figure on the deck of the Titanic...nothing to brag about #DisgracefulDonny #ShowUsYourTaxes", "I bet co president putin just loved those sanctions trump put on him. Must be into masochism or something. ", "If by filling people's ears with lies is the new, \"telling the truth,\" and corruption is the new \"honesty,\" and being a traitor is the new \"patriot,\" then he is doing a great job.", "Bravo!!   Yes we are One!! It feels so wonderful !!  after 8 yrs of BHO and his divisive American hating Admin, along with our Great President Trump we are screaming GOD BLESS AMERICA @realDonaldTrump https://twitter.com/KLHirst1/status/1038556624208707584 …", "59 more days then we'll see what you have to say and then Mueller will be right after that.", "Lmao. That's awesome."]}, "2018-09-11": {"neg": ["Wrong!!!!  Because of the local corrupt government in Puerto Rico!  Do you remember when the Mayor was pleading for help live on TV, complaining there’s no food, water & etc. while on the other hand we can see stacks of food, water behind her!", "Your poor family", "Pathetic n tragically comedic", "WTF does Putin have on you?", "@realDonaldTrump @LouDobbs @seanhannity @TuckerCarlson @Snick12 @SebGorka @dbongino - @POTUS Cold War was NEVER OVER -https://foreignpolicy.com/2017/08/25/the-secret-history-of-diplomats-and-invisible-weapons-russia-cuba/ …", "Trump is a very sick man. He is toxic and mean spirited.", "@realDonaldTrump - keepin’ it classy since 2001. #moron #IdiotInChief #TrumpTurd\nHttps://m.huffpost.com/us/entry/us_5b97a998e4b0162f4730e114/amp …", "Donald Trump Falsely Boasted About Having Tallest Building In 9/11 Aftermath | HuffPost https://www.huffingtonpost.com/entry/donald-trump-911-new-york-building-tallest_us_5b97a998e4b0162f4730e114 …", "Sarah and trump are our reminders of evil lying bigots in the world", "People who speak out against President Trump, are speaking out against God.  The \"fake news\" media is on Satan's frequency!"], "pos": ["Delusional at best... // Trump: Federal Response To Puerto Rico 'An Incredible Unsung Success' https://crooksandliars.com/2018/09/trump-federal-response-puerto-rico … #PuertoRico", "@realDonaldTrump has gone the most years since #September11th Best president ever! So much better than #Obama...nah, fuck that orange colon blemish.", "Im just glad Puerto Rico isn’t being hit because Trump", "True*\n\n*But there should perhaps be an 'Except for Trump tweets' clause?", "Nice tits @realDonaldTrump", "Didn't they win a Trump award?", "I love @realDonaldTrump thank you for everything you do sir ", "Undoubtedly, Kruz is King Kuck. Trump insulted his wife and dad in ‘16, but that hasn’t kept him from being completely owned by Hair Fuhrer ever since. Seems like kind of a pattern; ask @LindseyGrahamSC. These cucks’ skeletons must be awesome.", "best wait till tomorrow, this will probablyb will  flip flop in the next Trump Tweet.", "Which one of these linked studies do you take to be the best and can you please summarise what it showed and how it showed it?"]}, "2018-09-18": {"neg": ["So the Dems &HRC pay for phony info (dossier), feed fake info to FISA court to be allowed to spy on Trump campaign &launch unfounded investigation all while FBI-who should be non partisan- are anti Trump &purposefully leak info to MSM and U call @POTUS lawless?!? Give-Me-A-Break.", "Well that’s a stupid post. Trump write it for you?", "Scum bag moron fatass colossal criminal idiot @realDonaldTrump https://twitter.com/ProudResister/status/1042163039418560512 …", "Serialbrain2 -Trump's secret message about 9-11 Read by The War Drummer https://youtu.be/x-PQVBx54bY  via @YouTube", "Reality:  all the books published against the President doesn’t make a dent to Trump’s base.  Ugh!", "So disappointed because Toad is my go-to for Mario Kart.", "YES, FALSE PROPHETS SUPPORT TRUMP RATHER THAN GOD, AND THAT IS NOT NEWS https://twitter.com/RawStory/status/1042197577746149377 …", "Meanwhile, Trump is creating jobs like crazy and draining the swamp.  Keep up the hate Ana...it is only motivating Trump supporters.", "It is unfortunate that Americans have had to contend with Stormy weather.", "Mr President don't worry about Democrats they are just bunch of Demones from hell trying to take this nation to hell with there leader Obama from behind the doors but there is power in the Blood of Jesus and Trump on 2020 Mr President i cover you with the Blood of Jesus https://twitter.com/realDonaldTrump/status/1042078523274485760 …"], "pos": ["Lol", "Awesome", "Moore, why do so called Christians like you dodge questions when asked why doesn't Trump express a sympathetic tone. For women who make accusations of sexual assault. You are a fraud. Trump has also been accused of sexual assault, and he has said he has sexually assaulted women", "Not trump, but with somebody else, and who could blame her. What’s good for the goose is good for the gander.", "I liked a @YouTube video http://youtu.be/5xjTvF3SJI4?a  Trump orders the release of FISA documents", "GIfs are gay.", "Trump 2020 confirmed https://twitter.com/nowthisnews/status/1042104213927542785 …", "The US Dollar Drops as Trump Announces That He'll Impose More Tariffs. Trump to levy $200 billion in tariffs on popular consumer products. #Newshttp://zpr.io/69bE9 ", "This is why Trump is a good investment. https://twitter.com/JuliaDavisNews/status/1042194583914991616 …", "Trump signs $55 billion bill to give vets more healthcare options, VA overhaul and more https://americanmilitarynews.com/2018/06/trump-signs-55-billion-bill-to-give-vets-more-healthcare-options-va-overhaul-and-more/ …"]}, "2018-09-07": {"neg": ["TRUMP IS AN EVIL RACIST BARBARIAN AND MONSTER.", "Outrageous, insulting and reckless. Trump should address him as Mister.", "Worst.", "Obama issues scathing indictment of Trump, who says he ‘fell asleep’ during speech ‘meaning too musing and concerned but less impulsive with no thrills!’ - Los Angeles Times https://apple.news/Au_SiCi8yTpG9h0kJ0eviuw …", "You're a fucking idiot", "@BarackObama the president that started the race division, islamphobia, racist you hate illegal immigrants, homophobic is you want people to use the bathroom of your gender\nObama returns to campaign trail with fiery speech, Trump counters 'I fell asleep'\n\nhttp://www.foxnews.com/politics/2018/09/07/obama-returns-to-campaign-trail-with-fiery-speech-trump-counters-fell-asleep.html …", "Says the person who has very bad grammer", "Obama teleprompter fail take 3:https://www.youtube.com/watch?v=p6bhhjv8s-c …", "Please take your TDS medicine...  Your hatred for POTUS is making you insane.", "The replies to this are hysterical coming from MAGAts who worship the biggest narcissist, ego-driven, boastful person on the planet. At least Obama is accomplished. Trump is just an ignorant, unqualified fake who lies to everyone about, well everything."], "pos": ["Ur full of it.", "LOVE HIM!!!!", "Kim Kardashian Has Done More For The Criminal Justice Reform System than Colin Kaepernick!!!  I am so proud of her\n\n Congratulations @KimKardashian!! The fact that you are working with the Trump Administration on this is AMAZING!  God will Bless YOU pic.twitter.com/SOtOgGg8w1", "FBHO was projecting. Good try tho, shill.", "Lol", "Love itGood Job Nike! I’m with @Kaepernick7 TODAY A COP FATALLY SHOT A MALE PERSON OF COLOR IN HIS OWN TEXAS APARTMENT. Explain that away @realDonaldTrump no comment", "I think he has to think about the rejuvenation of his own country rather than the ruination of another", "yeah, I'm sure Trump will start packing now that Brucey has spoken", "Brian, I am so happy that Obama has pulled off his gloves and jumped back into the ring.  Obama has nothing to lose (job wise) and no reason to back down from Trump whatsoever and I love it.", "#Winning"]}}